print("Переменные в Python")

print("Переменные в python создаются легко, нужно лишь написать что то - это название переменной. Переменная - это контейнер в котором мы храним какие либо данные(данные это цифры/текст без контекста).Пример: Box = 2 или Num = 4. \nДынными ты можешь как либо манипулировать: изменять, удолять. Переменные нужны для хранения каких либо данных на время их исполнения. Название пременной не может начинатся на цифры или спец-символы. \nПример: 342Box или $Num")

text = input("Создай пременную: ")

print("Первый шаг сделан! Ты создал переменную: " + text + "\nТеперь давай изучим типы данных Python")

type_per = "Пока разберем 4 типа данных: number = 5, fnumber = 5.7, name = \"Alex\" status = true/false. Так же воспользуемся \"Комментариями\", комментарии создаются с помощью #"

